-- vector 확장 설치
CREATE EXTENSION IF NOT EXISTS vector;

-- 카테고리 테이블
CREATE TABLE categories (
    id SERIAL PRIMARY KEY,
    category_name VARCHAR NOT NULL
);

-- 카테고리 데이터 삽입
INSERT INTO
    categories (id, category_name)
VALUES (1, 'restaurant'),
    (2, 'spot'),
    (3, 'festival'),
    (4, 'common');

-- 지역 테이블
CREATE TABLE regions (
    id SERIAL PRIMARY KEY,
    name varchar(20),
    parent_id INT,
    lat FLOAT,
    lng FLOAT
);

-- 지역 데이터 삽입
INSERT INTO regions (id, name, parent_id, lat, lng) VALUES
(0, '서울특별시', NULL, 37.5665, 126.9780),
(1, '부산광역시', NULL, 35.1796, 129.0756),
(2, '대구광역시', NULL, 35.8714, 128.6014),
(3, '인천광역시', NULL, 37.4563, 126.7052),
(4, '광주광역시', NULL, 35.1595, 126.8526),
(5, '대전광역시', NULL, 36.3504, 127.3845),
(6, '울산광역시', NULL, 35.5384, 129.3114),
(7, '세종특별자치시', NULL, 36.4800, 127.2890),
(8, '경기도', NULL, 37.2751, 127.0093),
(9, '강원특별자치도', NULL, 37.8854, 127.7298),
(10, '충청북도', NULL, 36.6357, 127.4917),
(11, '충청남도', NULL, 36.5184, 126.8000),
(12, '전북특별자치도', NULL, 35.7175, 127.1530),
(13, '전라남도', NULL, 34.8679, 126.9910),
(14, '경상북도', NULL, 36.4919, 128.8889),
(15, '경상남도', NULL, 35.4606, 128.2132),
(16, '제주특별자치도', NULL, 33.4890, 126.4983),
(17, '수원시', 8, 37.2636, 127.0286),
(18, '성남시', 8, 37.4200, 127.1265),
(19, '고양시', 8, 37.6584, 126.8320),
(20, '용인시', 8, 37.2411, 127.1775),
(21, '부천시', 8, 37.5034, 126.7660),
(22, '안산시', 8, 37.3219, 126.8309),
(23, '안양시', 8, 37.3943, 126.9568),
(24, '남양주시', 8, 37.6350, 127.2165),
(25, '화성시', 8, 37.1990, 126.8312),
(26, '평택시', 8, 36.9947, 127.0885),
(27, '의정부시', 8, 37.7381, 127.0337),
(28, '시흥시', 8, 37.3800, 126.8020),
(29, '파주시', 8, 37.7599, 126.7802),
(30, '광명시', 8, 37.4782, 126.8644),
(31, '김포시', 8, 37.6153, 126.7150),
(32, '광주시', 8, 37.4292, 127.2550),
(33, '군포시', 8, 37.3614, 126.9350),
(34, '이천시', 8, 37.2726, 127.4359),
(35, '양주시', 8, 37.7851, 127.0459),
(36, '오산시', 8, 37.1498, 127.0772),
(37, '구리시', 8, 37.5943, 127.1290),
(38, '안성시', 8, 37.0050, 127.2797),
(39, '의왕시', 8, 37.3445, 126.9683),
(40, '하남시', 8, 37.5393, 127.2143),
(41, '포천시', 8, 37.8943, 127.2006),
(42, '여주시', 8, 37.2981, 127.6371),
(43, '동두천시', 8, 37.9036, 127.0605),
(44, '과천시', 8, 37.4292, 126.9873),
(45, '가평군', 8, 37.8315, 127.5093),
(46, '연천군', 8, 38.0960, 127.0750),
(47, '양평군', 8, 37.4919, 127.4875),
(48, '춘천시', 9, 37.8813, 127.7298),
(49, '원주시', 9, 37.3422, 127.9202),
(50, '강릉시', 9, 37.7519, 128.8761),
(51, '동해시', 9, 37.5246, 129.1143),
(52, '태백시', 9, 37.1641, 128.9856),
(53, '속초시', 9, 38.2070, 128.5912),
(54, '삼척시', 9, 37.4499, 129.1658),
(55, '홍천군', 9, 37.6918, 127.8888),
(56, '횡성군', 9, 37.4916, 127.9856),
(57, '영월군', 9, 37.1835, 128.4615),
(58, '평창군', 9, 37.3704, 128.3900),
(59, '정선군', 9, 37.3808, 128.6608),
(60, '철원군', 9, 38.1460, 127.3135),
(61, '화천군', 9, 38.1064, 127.7080),
(62, '양구군', 9, 38.1096, 127.9893),
(63, '인제군', 9, 38.0697, 128.1702),
(64, '고성군', 9, 38.3803, 128.4676),
(65, '양양군', 9, 38.0755, 128.6194),
(66, '청주시', 10, 36.6424, 127.4890),
(67, '충주시', 10, 36.9910, 127.9251),
(68, '제천시', 10, 37.1326, 128.1906),
(69, '보은군', 10, 36.4895, 127.7298),
(70, '옥천군', 10, 36.3064, 127.5718),
(71, '영동군', 10, 36.1744, 127.7830),
(72, '증평군', 10, 36.7852, 127.5810),
(73, '진천군', 10, 36.8554, 127.4353),
(74, '괴산군', 10, 36.8153, 127.7862),
(75, '음성군', 10, 36.9403, 127.6908),
(76, '단양군', 10, 36.9854, 128.3656),
(77, '천안시', 11, 36.8151, 127.1139),
(78, '공주시', 11, 36.4467, 127.1190),
(79, '보령시', 11, 36.3339, 126.6129),
(80, '아산시', 11, 36.7898, 127.0012),
(81, '서산시', 11, 36.7845, 126.4502),
(82, '논산시', 11, 36.1870, 127.0980),
(83, '계룡시', 11, 36.2744, 127.2486),
(84, '당진시', 11, 36.8893, 126.6454),
(85, '금산군', 11, 36.1081, 127.4884),
(86, '부여군', 11, 36.2752, 126.9095),
(87, '서천군', 11, 36.0800, 126.6913),
(88, '청양군', 11, 36.4540, 126.8028),
(89, '홍성군', 11, 36.6012, 126.6608),
(90, '예산군', 11, 36.6827, 126.8501),
(91, '태안군', 11, 36.7450, 126.2987),
(92, '전주시', 12, 35.8242, 127.1480),
(93, '군산시', 12, 35.9677, 126.7366),
(94, '익산시', 12, 35.9483, 126.9577),
(95, '정읍시', 12, 35.5699, 126.8514),
(96, '남원시', 12, 35.4165, 127.3906),
(97, '김제시', 12, 35.8030, 126.8807),
(98, '완주군', 12, 35.9040, 127.1620),
(99, '진안군', 12, 35.7916, 127.4242),
(100, '무주군', 12, 36.0050, 127.6608),
(101, '장수군', 12, 35.6494, 127.5215),
(102, '임실군', 12, 35.6173, 127.2891),
(103, '순창군', 12, 35.3740, 127.1383),
(104, '고창군', 12, 35.4350, 126.7018),
(105, '부안군', 12, 35.7286, 126.7360),
(106, '목포시', 13, 34.8118, 126.3923),
(107, '여수시', 13, 34.7604, 127.6622),
(108, '순천시', 13, 34.9481, 127.4891),
(109, '나주시', 13, 35.0283, 126.7175),
(110, '광양시', 13, 34.9406, 127.6959),
(111, '담양군', 13, 35.3211, 126.9881),
(112, '곡성군', 13, 35.2810, 127.2977),
(113, '구례군', 13, 35.2094, 127.4646),
(114, '고흥군', 13, 34.6167, 127.2846),
(115, '보성군', 13, 34.7644, 127.0801),
(116, '화순군', 13, 35.0648, 126.9859),
(117, '장흥군', 13, 34.6816, 126.9071),
(118, '강진군', 13, 34.6390, 126.7673),
(119, '해남군', 13, 34.5720, 126.5980),
(120, '영암군', 13, 34.8006, 126.7021),
(121, '무안군', 13, 34.9875, 126.4811),
(122, '함평군', 13, 35.0657, 126.5160),
(123, '영광군', 13, 35.2771, 126.5119),
(124, '장성군', 13, 35.3010, 126.7845),
(125, '완도군', 13, 34.3110, 126.7550),
(126, '진도군', 13, 34.4844, 126.2635),
(127, '신안군', 13, 34.8260, 126.1086),
(128, '포항시', 14, 36.0190, 129.3435),
(129, '경주시', 14, 35.8562, 129.2247),
(130, '김천시', 14, 36.1216, 128.1198),
(131, '안동시', 14, 36.5684, 128.7294),
(132, '구미시', 14, 36.1195, 128.3446),
(133, '영주시', 14, 36.8057, 128.6240),
(134, '영천시', 14, 35.9733, 128.9389),
(135, '상주시', 14, 36.4152, 128.1591),
(136, '문경시', 14, 36.5946, 128.1996),
(137, '경산시', 14, 35.8265, 128.7370),
(138, '의성군', 14, 36.3526, 128.6972),
(139, '청송군', 14, 36.4336, 129.0570),
(140, '영양군', 14, 36.6808, 129.1124),
(141, '영덕군', 14, 36.4150, 129.3657),
(142, '청도군', 14, 35.6474, 128.7334),
(143, '고령군', 14, 35.7290, 128.2620),
(144, '성주군', 14, 35.9191, 128.2826),
(145, '칠곡군', 14, 35.9957, 128.4010),
(146, '예천군', 14, 36.6576, 128.4529),
(147, '봉화군', 14, 36.8882, 128.7375),
(148, '울진군', 14, 36.9931, 129.4004),
(149, '울릉군', 14, 37.4846, 130.9063),
(150, '창원시', 15, 35.2283, 128.6811),
(151, '진주시', 15, 35.1796, 128.1076),
(152, '통영시', 15, 34.8544, 128.4330),
(153, '사천시', 15, 35.0038, 128.0641),
(154, '김해시', 15, 35.2285, 128.8890),
(155, '밀양시', 15, 35.4934, 128.7480),
(156, '거제시', 15, 34.8806, 128.6219),
(157, '양산시', 15, 35.3385, 129.0340),
(158, '의령군', 15, 35.3191, 128.2618),
(159, '함안군', 15, 35.2724, 128.4065),
(160, '창녕군', 15, 35.5410, 128.4950),
(161, '고성군', 15, 34.9720, 128.3220),
(162, '남해군', 15, 34.8370, 127.8926),
(163, '하동군', 15, 35.0674, 127.7514),
(164, '산청군', 15, 35.4140, 127.8730),
(165, '함양군', 15, 35.5204, 127.7255),
(166, '거창군', 15, 35.6710, 127.9096),
(167, '합천군', 15, 35.5667, 128.1667);

-- 장소 테이블
CREATE TABLE places (
    id SERIAL PRIMARY KEY,
    category_id INT NOT NULL REFERENCES categories (id) ON DELETE CASCADE,
    region_id INT NOT NULL REFERENCES regions (id) ON DELETE CASCADE,
    kakao_id INT,
    place_name VARCHAR(50),
    place_url VARCHAR(500),
    address_name VARCHAR(150),
    road_address_name VARCHAR(150) NOT NULL,
    lng FLOAT NOT NULL,
    lat FLOAT NOT NULL,
    embedding VECTOR
);

-- 장소 태그 테이블
CREATE TABLE place_metadata_tags (
    id SERIAL PRIMARY KEY,
    place_id INT NOT NULL REFERENCES places (id) ON DELETE CASCADE,
    content VARCHAR(30) NOT NULL
);

-- 장소 이미지 테이블
CREATE TABLE place_metadata_images (
    id BIGSERIAL PRIMARY KEY,
    place_id INT NOT NULL REFERENCES places (id) ON DELETE CASCADE,
    img_url VARCHAR(500) NOT NULL
);

-- 음식점 테이블
CREATE TABLE restaurants (
    id SERIAL PRIMARY KEY,
    place_id INT NOT NULL REFERENCES places (id) ON DELETE CASCADE,
    description TEXT,
    description_short TEXT,
    tel VARCHAR(50),
    homepage VARCHAR(255),
    business_hours VARCHAR(255),
    rest_date VARCHAR(100),
    parking VARCHAR(100)
);

-- 음식점 메뉴 테이블
CREATE TABLE restaurant_menus (
    id SERIAL PRIMARY KEY,
    restaurant_id INT NOT NULL REFERENCES restaurants (id) ON DELETE CASCADE,
    menu VARCHAR(30) NOT NULL
);

-- 명소 테이블
CREATE TABLE spots (
    id SERIAL PRIMARY KEY,
    place_id INT NOT NULL REFERENCES places (id) ON DELETE CASCADE,
    description TEXT,
    description_short TEXT,
    info_center VARCHAR(50),
    homepage VARCHAR(255),
    business_hours VARCHAR(255),
    rest_date VARCHAR(100),
    parking VARCHAR(100),
    price VARCHAR(100)
);

-- 축제 테이블
CREATE TABLE festivals (
    id SERIAL PRIMARY KEY,
    place_id INT NOT NULL REFERENCES places (id) ON DELETE CASCADE,
    description TEXT,
    description_short TEXT,
    homepage VARCHAR(255),
    info_center VARCHAR(100),
    period VARCHAR(100),
    price VARCHAR(100),
    organizer VARCHAR(50),
    sns VARCHAR(100)
);